const reviewsArray = [
    {
        name: 'Alex',
        text: "Телефон дуже хороший, флагман не може бути не хорошим, фоткає дуже чітко, були дуже вражені від такої камери. Екран дуже яскравий, навіть на сонці яскраво світить, і ще дуже круто що 120 герц. Пам'яті бажано брати 512 гб для кого ціна велика за телефон, він цю ціну виправдовує. Добре працює в автономності, граючи у важкі ігри тримає більше 6 годин, також нова функція на екрані Dynamic island для кого як, але вона чудова реалізована. Ну а так що ще сказати це Apple він не коли не може бути поганим. ",
    },
    {
        name: 'Vlad',
        text: 'Хотів би сказати що цей айфон просто відмінний і відповідає цим грошам! Звичайно Apple подбав про нові налаштування цього айфона, чубчик у цього айфона взагалі клас, стало зручніше користуватися, так само можна приймати повідомлення через цей чубчик. Ну телефон підходить як для роботи, так і для домашнього користування! Впевнений не пошкодуєте купивши його, якість відмінна, iOS відмінний, за такі гроші та якість , хороший телефон! Хто хоче придбати, але вагається, треба його брати, він дуже зручний комфортний, і якісний, просто бомба!',
    },
    {
        name: 'Taras',
        text: 'Дуже сподобався, рекомендую! Камера 48 мп просто вау! Телефон великий, але зручно лежить у руці) Сподобався дизайн, звук гарний і обʼємний! Найпотужніший процесор серед усіх смартфонів!,',
    },
]

export default reviewsArray
